{
    "lessons" : [
        {   
            "course_id": 101,
            "lesson_id": 1011,
            "modules": [
                {
                    "module_id": 1,
                    "module_title": "What is Linear Algebra?",
                    "module_content": [
                        "Linear Algebra is a branch of mathematics that focuses on the study of vectors, vector spaces, linear transformations, and systems of linear equations.",
                        "It involves understanding how these mathematical objects interact with one another through operations like addition and multiplication.",
                        "Linear algebra is foundational in various fields, including physics, engineering, computer science, and economics, as it provides tools for modeling and solving problems related to multidimensional data, optimization, and transformations.",
                        "Concepts such as matrices and determinants are central in this discipline, facilitating efficient computation and data manipulation."
                    ],
                    "video_url": "https://www.youtube.com/embed/csgNflj69-Y"
                },
                {
                    "module_id": 2,
                    "module_title": "Vectors and Vector Spaces",
                    "module_content": [
                        "A vector is a mathematical object that has both magnitude and direction.",
                        "Vectors can be represented in multiple dimensions and are fundamental to linear algebra.",
                        "Vector spaces are collections of vectors that satisfy certain properties under addition and scalar multiplication.",
                        "Understanding vector spaces is crucial for advanced topics in linear algebra."
                    ],
                    "video_url": "https://www.youtube.com/embed/fNk_zzaMoSs"
                },
                {
                    "module_id": 3,
                    "module_title": "Matrices and Operations",
                    "module_content": [
                        "Matrices are rectangular arrays of numbers organized in rows and columns.",
                        "Matrix operations include addition, subtraction, and multiplication.",
                        "Matrices are used to represent linear transformations and solve systems of equations.",
                        "Understanding matrix properties is essential for practical applications in computer graphics and data science."
                    ],
                    "video_url": "https://www.youtube.com/embed/ZFVFtVbeerI"
                }
            ],
            "assignment": {
                "tasks": [
                    {
                        "task_id": 1,
                        "question": "What is the definition of a vector in linear algebra?",
                        "description": "Explain what a vector is, including its properties of magnitude and direction."
                    },
                    {
                        "task_id": 2,
                        "question": "Describe the difference between a vector space and a regular set of numbers.",
                        "description": "Explain the key properties that define a vector space and how they differ from arbitrary collections of numbers."
                    },
                    {
                        "task_id": 3,
                        "question": "What are the practical applications of matrices in real-world scenarios?",
                        "description": "Provide at least three examples of how matrices are used in computer graphics, data science, or engineering."
                    }
                ]
            }
        },
        {   
            "course_id": 102,
            "lesson_id": 1021,
            "modules": [
                {
                    "module_id": 1,
                    "module_title": "Introduction to Calculus",
                    "module_content": [
                        "Calculus is the mathematical study of continuous change.",
                        "It has two main branches: differential calculus and integral calculus.",
                        "Differential calculus deals with rates of change and slopes of curves.",
                        "Integral calculus deals with accumulation and areas under curves."
                    ],
                    "video_url": "https://www.youtube.com/embed/UukVP7Mg3TU"
                },
                {
                    "module_id": 2,
                    "module_title": "Limits and Continuity",
                    "module_content": [
                        "Limits describe the value that a function approaches as the input approaches some value.",
                        "Understanding limits is fundamental to calculus.",
                        "Continuity refers to the property of a function being unbroken or uninterrupted.",
                        "A function is continuous if its limit exists at every point in its domain."
                    ],
                    "video_url": "https://www.youtube.com/embed/WzVQJ6VaJZ0"
                }
            ],
            "assignment": {
                "tasks": [
                    {
                        "task_id": 1,
                        "question": "What are the two main branches of calculus?",
                        "description": "Explain the difference between differential and integral calculus and provide examples of each."
                    },
                    {
                        "task_id": 2,
                        "question": "Define the concept of a limit in calculus.",
                        "description": "Explain what a limit is and why it's important for understanding derivatives and integrals."
                    },
                    {
                        "task_id": 3,
                        "question": "What does it mean for a function to be continuous?",
                        "description": "Describe continuity and explain how it relates to limits. Give examples of continuous and discontinuous functions."
                    }
                ]
            }
        }
    ]
}